tap "anomalyco/tap"
tap "jesseduffield/lazygit"

# Shell & Terminal Utilities
brew "bash"
brew "bat"
brew "fzf"
brew "git"
brew "gh"
brew "tmux"
brew "stow"       
brew "zoxide"    
brew "eza"      

# Desarrollo & Compiladores
brew "gcc"
brew "maven"
brew "nvm"
brew "tree-sitter-cli"
brew "lazygit"

# Herramientas CLI para Neovim 
brew "ripgrep"
brew "fd"

# Editores & IA
brew "neovim"
brew "anomalyco/tap/opencode"

# Servidores de Lenguaje (LSP) nativos de tu init.lua
brew "lua-language-server"   # Para lua_ls
brew "jdtls"                 # Para jdtls
brew "marksman"              # Para marksman
brew "yaml-language-server"  # Para yamlls

# NOTA: ts_ls y eslint se instalan idealmente vía npm globalmente 
